{
    "locales": {
        "en": {
            "title": "<span class='text-primary'>Professional</span> Experience",
            "description": "A look into my work experience and career journey."
        }
    },
    "items": [
        {
            "id": "experience_item_1",
            "place": "@link{places.whizlabs}",
            "period": [
                "2021/09",
                "2022/02"
            ],
            "locales": {
                "en": {
                    "title": "AWS Intern",
                    "description": "1. Built various AWS labs which had impacted more than 1000 new learners. <br>2. Integrated various AWS services like AWS Lambda, Boto3 SDK, CloudWatch, IAM, etc. to provide seamless service to the customer. <br>3. Solved production issues by finding the root cause and preventing any damage to the organization. <br>4. Troubleshoot customer problems and assisted them with innovative solutions. <br>5. Used software like Confluence & Jira to follow Agile Methodology in the development."
                }
            }
        },
        {
            "id": "experience_item_2",
            "place": "@link{places.tcs}",
            "period": [
                "2022/07",
                "2024/12"
            ],
            "locales": {
                "en": {
                    "title": "Cloud Engineer",
                    "description": "1. Migrated legacy on-prem application to AWS cloud-native platform using technologies like EC2, S3, NLB, API Gateway, Lambda and ECS for 90% scalability boost & higher loan processing volume. <br>2. Implemented multi-layered API Gateway security using multi-factor authentication via Cognito, granular access control through IAM Roles and Policies, and dynamic API key rotation using Secrets Manager, achieving 100% compliance with industry security standards. <br>3. Engineered an automated build script utilizing Bash Script and ECS for Lambda packages, strengthened security protocols and achieved 99% compliance with the client's stringent cybersecurity standards. <br>4. Reduced manual efforts by 95% through a proprietary script that transitions business rules to JSONLogic in Python and Cloud9 for streamlined decision processes. <br>5. Designed and implemented a robust real-time monitoring framework with CloudWatch and Kibana; achieved 99.95% service uptime and reduced incident response time by 50%. <br>6. Boosted deployment efficiency by 97% & enhanced automation using Node.js and GitHub Actions for the client via parallel processing. <br>7. Orchestrated optimization of project strategies with TCS SME team, aligning with client tech objectives;  enhanced innovation output by 30% and accelerated project completion by 20%."
                }
            }
        }
    ]
}